*&---------------------------------------------------------------------*
*&  Include           MZA01101F01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Form  GET_INFO
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
*  -->  p1        text
*  <--  p2        text
*----------------------------------------------------------------------*
FORM get_info .

  "Get Airline info
  "우리 지금 사용 테이블 scarr
  CLEAR ZBCA01003.
  SELECT SINGLE carrid carrname currcode
  FROM scarr
  INTO CORRESPONDING FIELDS OF ZBCA01003
  where carrid eq ZSA001002-carrid.
  IF sy-subrc <> 0. "위에 코드에서 성공여부
    MESSAGE i008(ZCAL_A_01).
  ENDIF.

ENDFORM.
