*&---------------------------------------------------------------------*
*&  Include           MZA01201O01
*&---------------------------------------------------------------------*
*&---------------------------------------------------------------------*
*&      Module  STATUS_0100  OUTPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE status_0100 OUTPUT.
  SET PF-STATUS 'S100'.
  SET TITLEBAR 'T100'.
ENDMODULE.
*&---------------------------------------------------------------------*
*&      Form  OUTPUT_MESSAGE
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
*  -->  p1        text
*  <--  p2        text
*----------------------------------------------------------------------*
FORM output_message .

  IF sy-subrc <> 0.
    MESSAGE i006(zcal_a_01).
    CLEAR zsa011101.
    CLEAR zsa011102.
  ENDIF.

ENDFORM.
*&---------------------------------------------------------------------*
*&      Form  GET_AIRPORT_NAME
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
*  -->  p1        text
*  <--  p2        text
*----------------------------------------------------------------------*
FORM get_airport_name .

  "이렇게 SELECT문 많이 쓰면 쿼리 조회 속도 느려짐 -> 별로 좋지 않은 방법
  "인터널 테이블 활용해서 조회하는 방법을 지향하기

  "출발공항 이름
  SELECT SINGLE name
    INTO zsa011102-airpfrom_t
    FROM sairport
    WHERE id = zsa011102-AIRPFROM_T.

  "도착공항 이름
  SELECT SINGLE name
    INTO zsa011102-airpto_t
    FROM sairport
    WHERE id = zsa011102-AIRPTO_T.


ENDFORM.
*&---------------------------------------------------------------------*
*&      Module  MODIFY_SCREEN_0100  OUTPUT
*&---------------------------------------------------------------------*
*       text
*----------------------------------------------------------------------*
MODULE modify_screen_0100 OUTPUT.

*  IF st-tcode = 'ZA01201_A'.
*    RETURN.
*  ENDIF.

  LOOP AT SCREEN. "screen은 걍 시스템에서 자동으로 만들어지는 인터널테이블 -> screen[]사실 이거
  "풀어서 쓰면 -> LOOP AT SCREEN[] INTO SCREEN.
   CASE screen-name.
   	WHEN 'zsa011101-carrid'.
*      IF st-tcode = 'ZA01201_A'.
*        RETURN.
*      ENDIF.
      screen-input = '0'. "사용자한테 보여줘도 됨 , 사용자가 수정은 불가
      screen-active = '0'.  "사용자에게 노출 불가, 사용자가 수정불가
    MODIFY SCREEN.
*    CLEAR screen. -> 워크에리아 screen클리어임. (인터널테이블 클리어아님)

   ENDCASE.

  ENDLOOP.

ENDMODULE.
