*&---------------------------------------------------------------------*
*& Module Pool       SAPMZA01201
*&
*&---------------------------------------------------------------------*
*&
*&
*&---------------------------------------------------------------------*


INCLUDE MZA01201TOP                             .    " global Data

 INCLUDE MZA01201O01                             .  " PBO-Modules
 INCLUDE MZA01201I01                             .  " PAI-Modules
 INCLUDE MZA01201F01                             .  " FORM-Routines

 LOAD-OF-PROGRAM. "프로그램을 맨 처음에 시작할때 ...?
  ZSA011101-CARRID = 'AA'. "기본값 설정
  ZSA011101-CONNID = '0017'.
